{
    "action_encode_transformer": false,
    "action_encode_transformer_dropout": 0.0,
    "activation_function": "gelu_new",
    "architectures": [
        "STR_Mixtral"
    ],
    "arf_x_random_walk": 0.0,
    "arf_y_random_walk": 0.0,
    "attention_dropout": 0.0,
    "attn_implementation": "flash_attention_2",
    "augment_current_pose_rate": 0.5,
    "augment_current_ratio": 0.3,
    "augment_current_with_future_linear_changes": false,
    "augment_current_with_past_linear_changes": true,
    "augment_index": 5,
    "autoregressive": false,
    "autoregressive_proposals": false,
    "bos_token_id": 1,
    "camera_image_encoder": null,
    "current_frame_only": false,
    "d_embed": 256,
    "d_inner": 1024,
    "d_model": 1024,
    "debug_raster_path": null,
    "dense_pred": false,
    "diffusion_condition_sequence_lenth": 1,
    "diffusion_feature_save_dir": null,
    "encoder_type": "raster",
    "eos_token_id": 2,
    "finetuning_gamma": 1,
    "finetuning_with_simulation_on_val": false,
    "finetuning_with_stepping": false,
    "finetuning_with_stepping_minimal_step": false,
    "finetuning_with_stepping_random_steps": false,
    "finetuning_with_stepping_without_first_step_loss": false,
    "first_frame_scele": 1000.0,
    "fused_add_norm": false,
    "future_sample_interval": 2,
    "future_seconds": 8,
    "generate_diffusion_dataset_for_key_points_decoder": false,
    "hidden_act": "silu",
    "hidden_size": 1024,
    "initializer_range": 0.02,
    "inspect_kp_loss": true,
    "intermediate_size": 4096,
    "k": 1,
    "key_points_diffusion_decoder_feat_dim": 256,
    "key_points_diffusion_decoder_load_from": null,
    "key_points_num": 5,
    "kp_decoder_type": "mlp",
    "kp_loss_rescale": 1.0,
    "loss_fn": "mse",
    "max_position_embeddings": 131072,
    "mc_num": 200,
    "mean_circular_loss": true,
    "mission_goal_dropout": 1.0,
    "model_name": "pretrained-mixtral-medium",
    "model_pretrain_name_or_path": "/cephfs/zhanjh/checkpoint/checkpoint-150000",
    "model_type": "mixtral",
    "n_embd": 1024,
    "n_head": 16,
    "n_heads": 8,
    "n_inner": 4096,
    "n_layer": 16,
    "n_layers": 4,
    "no_yaw_with_stepping": false,
    "num_attention_heads": 16,
    "num_experts_per_tok": 2,
    "num_hidden_layers": 16,
    "num_key_value_heads": 8,
    "num_local_experts": 8,
    "output_router_logits": false,
    "past_sample_interval": 2,
    "pred_key_points_only": false,
    "pred_traj_only": false,
    "predict_yaw": true,
    "pretrain_encoder": false,
    "proposal_num": 13,
    "proposal_path": "data/waymo/cluster_64_center_dict.pkl",
    "raster_channels": 34,
    "raster_encoder_type": "vit",
    "residual_in_fp32": false,
    "reverse_traj_index_order": false,
    "rms_norm": false,
    "rms_norm_eps": 1e-05,
    "rope_theta": 1000000.0,
    "router_aux_loss_coef": 0.001,
    "selected_exponential_past": true,
    "separate_kp_encoder": true,
    "sim_eval_with_gt": false,
    "simulate_one_step_on_training": false,
    "simulate_with_5f_smoothing": false,
    "skip_yaw_norm": false,
    "sliding_window": null,
    "sync_norm": true,
    "task": "nuplan",
    "tie_word_embeddings": false,
    "torch_dtype": "float32",
    "train_camera_image_folder": null,
    "trajectory_loss_rescale": 1.0,
    "trajectory_prediction_mode": "all_frames",
    "transformers_version": "4.38.2",
    "use_cache": true,
    "use_key_points": "specified_backward",
    "use_mission_goal": false,
    "use_proposal": 0,
    "use_speed": true,
    "val_camera_image_folder": null,
    "vit_intermediate_size": 768,
    "vocab_size": 32000,
    "with_traffic_light": true,
    "x_random_walk": 0.0,
    "y_random_walk": 0.0
}